["", "[UNK]", "sos", "eos", "1001", "962", "1589", "1363", "126", "67", "268", "1372", "1189", "1107", "533", "470", "319", "1568", "98", "943", "752", "68", "63", "588", "396", "376", "344", "18", "1471", "1334", "1190", "1150", "1088", "978", "975", "950", "948", "933", "931", "929", "922", "921", "887", "881", "83", "814", "783", "773", "77", "767", "753", "745", "72", "716", "706", "7", "695", "694", "671", "651", "650", "627", "625", "619", "613", "595", "573", "518", "513", "512", "51", "408", "399", "342", "331", "307", "289", "287", "252", "251", "25", "241", "236", "234", "230", "23", "228", "226", "215", "192", "186", "17", "165", "1613", "1600", "1584", "1562", "1541", "1507", "1493", "145", "1430", "1410", "1402", "1367", "1340", "1328", "1309", "1286", "1283", "1217", "1202", "1174", "1173", "1142", "1129", "1115", "1074", "1061", "1041", "1006", "1004", "999", "998", "997", "996", "995", "994", "993", "992", "991", "99", "989", "987", "986", "985", "984", "983", "982", "981", "980", "979", "977", "976", "974", "973", "972", "971", "970", "97", "969", "968", "967", "966", "965", "964", "963", "961", "960", "96", "957", "956", "955", "954", "953", "952", "951", "95", "947", "946", "945", "944", "942", "941", "940", "94", "939", "938", "937", "936", "935", "934", "932", "930", "93", "928", "927", "925", "924", "923", "92", "919", "918", "915", "913", "912", "911", "910", "91", "909", "908", "907", "906", "905", "904", "903", "902", "901", "900", "90", "9", "899", "898", "897", "896", "895", "894", "893", "892", "891", "89", "889", "888", "886", "885", "884", "883", "882", "880", "88", "879", "878", "877", "876", "875", "872", "871", "870", "87", "869", "868", "867", "866", "865", "864", "863", "862", "861", "860", "86", "858", "857", "856", "855", "854", "853", "852", "851", "850", "85", "849", "848", "847", "846", "844", "843", "842", "841", "840", "839", "838", "837", "836", "835", "834", "833", "832", "831", "830", "829", "828", "827", "826", "825", "824", "823", "822", "821", "820", "82", "819", "818", "817", "813", "811", "810", "81", "809", "808", "806", "805", "804", "803", "802", "801", "800", "80", "8", "799", "798", "796", "795", "794", "793", "792", "791", "790", "79", "789", "788", "787", "786", "785", "782", "781", "780", "78", "779", "778", "777", "776", "775", "774", "772", "771", "769", "768", "766", "765", "764", "763", "762", "761", "760", "76", "759", "758", "757", "756", "755", "754", "751", "750", "75", "749", "748", "747", "746", "744", "743", "742", "741", "740", "74", "739", "738", "737", "736", "735", "734", "732", "731", "729", "728", "727", "726", "725", "724", "723", "722", "721", "720", "718", "717", "715", "714", "713", "712", "711", "710", "71", "709", "708", "704", "703", "701", "700", "70", "699", "698", "696", "693", "692", "690", "69", "688", "687", "686", "685", "684", "683", "682", "681", "679", "678", "677", "675", "674", "673", "672", "670", "669", "667", "666", "665", "664", "663", "662", "661", "660", "66", "659", "658", "657", "656", "655", "654", "652", "65", "649", "648", "647", "643", "641", "640", "64", "639", "637", "636", "635", "634", "633", "632", "631", "630", "628", "626", "624", "623", "622", "621", "620", "62", "617", "616", "615", "614", "612", "61", "609", "608", "607", "606", "605", "604", "603", "602", "601", "600", "60", "599", "598", "597", "596", "594", "593", "592", "591", "590", "59", "589", "586", "585", "584", "582", "581", "58", "579", "577", "576", "575", "574", "572", "571", "570", "57", "569", "568", "567", "566", "565", "564", "563", "562", "561", "560", "56", "559", "558", "557", "556", "555", "554", "553", "552", "550", "55", "549", "548", "547", "546", "545", "544", "543", "542", "541", "540", "54", "539", "538", "537", "536", "535", "534", "532", "531", "53", "529", "528", "527", "526", "525", "524", "523", "522", "521", "520", "52", "519", "517", "516", "515", "514", "511", "510", "509", "508", "507", "506", "505", "504", "503", "501", "500", "50", "5", "498", "497", "496", "495", "494", "493", "492", "491", "490", "49", "489", "488", "487", "486", "485", "484", "483", "482", "481", "480", "479", "478", "477", "476", "475", "474", "473", "472", "471", "47", "469", "468", "467", "466", "465", "464", "463", "462", "461", "460", "46", "459", "457", "456", "454", "453", "452", "451", "450", "45", "449", "448", "447", "446", "445", "444", "443", "442", "441", "440", "44", "438", "437", "436", "435", "434", "433", "431", "430", "43", "429", "427", "426", "425", "424", "423", "422", "421", "420", "42", "419", "418", "417", "416", "414", "413", "412", "411", "410", "41", "409", "407", "404", "403", "402", "401", "400", "40", "4", "398", "397", "395", "394", "393", "392", "391", "390", "39", "389", "388", "387", "386", "385", "384", "382", "381", "380", "38", "379", "378", "377", "375", "374", "373", "372", "371", "370", "37", "369", "368", "367", "366", "365", "364", "363", "362", "361", "360", "359", "358", "357", "355", "354", "353", "352", "351", "35", "349", "348", "347", "346", "345", "343", "341", "340", "34", "339", "338", "337", "336", "335", "334", "332", "330", "33", "329", "328", "327", "326", "325", "324", "323", "322", "321", "320", "32", "318", "317", "316", "315", "314", "313", "312", "311", "310", "31", "309", "308", "306", "305", "304", "303", "302", "301", "300", "30", "3", "298", "297", "296", "295", "294", "292", "291", "290", "286", "284", "283", "282", "281", "280", "28", "279", "278", "277", "276", "275", "274", "273", "272", "271", "27", "269", "267", "266", "265", "264", "263", "262", "261", "260", "26", "259", "258", "257", "256", "255", "254", "253", "250", "248", "247", "246", "245", "243", "242", "240", "24", "239", "238", "237", "235", "233", "232", "229", "227", "225", "224", "223", "222", "221", "220", "22", "219", "218", "216", "214", "213", "212", "211", "210", "209", "208", "206", "205", "204", "203", "201", "200", "20", "2", "199", "198", "197", "196", "195", "194", "193", "191", "190", "19", "189", "188", "187", "185", "184", "183", "182", "181", "180", "179", "178", "177", "176", "175", "174", "172", "171", "170", "169", "168", "167", "1666", "1665", "1664", "1663", "1662", "1661", "1660", "166", "1659", "1657", "1656", "1655", "1654", "1653", "1652", "1651", "1649", "1647", "1646", "1645", "1644", "1643", "1642", "1641", "1640", "164", "1639", "1638", "1637", "1636", "1635", "1634", "1633", "1632", "1631", "1630", "1629", "1628", "1627", "1626", "1625", "1624", "1623", "1622", "1621", "1620", "162", "1619", "1618", "1616", "1615", "1614", "1612", "1611", "1610", "161", "1609", "1608", "1607", "1606", "1605", "1604", "1603", "1602", "1601", "160", "16", "1599", "1598", "1597", "1596", "1595", "1594", "1593", "1592", "1590", "159", "1588", "1587", "1586", "1585", "1583", "1582", "1581", "1580", "158", "1578", "1577", "1576", "1575", "1574", "1573", "1571", "1570", "157", "1569", "1567", "1566", "1565", "1564", "1563", "1561", "1560", "156", "1559", "1558", "1557", "1556", "1555", "1554", "1553", "1552", "1551", "1550", "155", "1549", "1548", "1547", "1546", "1545", "1544", "1543", "1542", "1540", "1539", "1538", "1537", "1536", "1535", "1534", "1533", "1532", "1531", "153", "1529", "1528", "1527", "1526", "1525", "1524", "1523", "1522", "1521", "1520", "1519", "1518", "1516", "1515", "1514", "1513", "1512", "1511", "1510", "1509", "1508", "1506", "1505", "1504", "1503", "1502", "1501", "1500", "150", "15", "1499", "1498", "1497", "1496", "1495", "1494", "1492", "1491", "1490", "149", "1489", "1488", "1486", "1485", "1484", "1483", "1482", "1481", "1480", "148", "1479", "1478", "1477", "1476", "1475", "1474", "1473", "1472", "1470", "147", "1469", "1468", "1467", "1466", "1465", "1464", "1463", "1462", "1461", "1460", "146", "1459", "1458", "1457", "1456", "1455", "1454", "1453", "1452", "1451", "1450", "1449", "1448", "1447", "1446", "1445", "1444", "1443", "1442", "1441", "1440", "144", "1439", "1438", "1436", "1435", "1434", "1433", "1432", "1431", "143", "1429", "1428", "1427", "1426", "1425", "1424", "1423", "1422", "1421", "1420", "142", "1419", "1418", "1417", "1416", "1415", "1414", "1413", "1412", "1411", "141", "1409", "1408", "1407", "1406", "1405", "1404", "1401", "1400", "140", "14", "1399", "1397", "1396", "1395", "1394", "1393", "1392", "1391", "1390", "1389", "1388", "1387", "1386", "1385", "1384", "1383", "1382", "138", "1379", "1378", "1377", "1376", "1375", "1374", "1373", "1370", "137", "1369", "1368", "1366", "1365", "1364", "1362", "1361", "1360", "136", "1358", "1357", "1355", "1354", "1353", "1352", "1351", "1350", "135", "1349", "1348", "1347", "1346", "1345", "1344", "1343", "1342", "1341", "134", "1339", "1338", "1337", "1336", "1335", "1333", "1332", "1331", "1330", "1327", "1326", "1325", "1324", "1323", "1322", "1321", "1320", "132", "1319", "1318", "1317", "1316", "1315", "1314", "1313", "1310", "131", "1308", "1307", "1306", "1305", "1303", "1302", "1301", "1300", "13", "1299", "1298", "1297", "1296", "1295", "1294", "1293", "1291", "1290", "1289", "1288", "1287", "1285", "1284", "1282", "1281", "1280", "128", "1279", "1278", "1277", "1276", "1275", "1274", "1272", "1271", "127", "1269", "1268", "1267", "1266", "1265", "1264", "1263", "1262", "1261", "1260", "1259", "1258", "1257", "1255", "1254", "1253", "1252", "125", "1249", "1248", "1246", "1245", "1244", "1243", "1242", "1241", "1240", "124", "1239", "1238", "1237", "1236", "1235", "1234", "1233", "1232", "1231", "1230", "123", "1228", "1227", "1226", "1225", "1224", "1223", "1222", "1221", "1220", "122", "1219", "1218", "1216", "1215", "1214", "1213", "1212", "1211", "1210", "121", "1209", "1207", "1206", "1205", "1204", "1203", "1201", "120", "12", "1199", "1198", "1197", "1196", "1195", "1194", "1193", "1192", "1191", "119", "1188", "1187", "1186", "1185", "1184", "1183", "1182", "1181", "1180", "118", "1179", "1177", "1175", "1172", "1171", "117", "1169", "1167", "1166", "1165", "1164", "1163", "1162", "1161", "1159", "1157", "1156", "1155", "1154", "1153", "1152", "1151", "115", "1149", "1148", "1147", "1146", "1145", "1144", "1141", "1140", "114", "1138", "1137", "1136", "1135", "1134", "1133", "1132", "1131", "1130", "113", "1128", "1127", "1125", "1124", "1123", "1122", "1121", "1120", "112", "1119", "1118", "1117", "1113", "1112", "1111", "111", "1108", "1106", "1105", "1104", "1103", "1102", "1101", "1100", "11", "1098", "1097", "1096", "1095", "1093", "1091", "1090", "109", "1089", "1087", "1086", "1085", "1084", "1083", "1081", "1080", "108", "1079", "1078", "1077", "1075", "1073", "1072", "1071", "1070", "107", "1069", "1068", "1067", "1066", "1065", "1063", "1062", "1060", "106", "1059", "1058", "1057", "1056", "1055", "1054", "1053", "1052", "1051", "1050", "105", "1048", "1047", "1046", "1045", "1044", "1043", "1042", "1040", "104", "1039", "1038", "1037", "1036", "1035", "1034", "1033", "1032", "1031", "1030", "103", "1029", "1028", "1027", "1025", "1024", "1023", "1022", "1021", "1020", "102", "1019", "1018", "1017", "1016", "1015", "1014", "1013", "1012", "1011", "1010", "101", "1009", "1008", "1007", "1003", "1002", "1000", "100", "10", "1", "0"]